{
  "main": {
    "name": "김수현",
    "paragraph": "About Me",
    "description": "인간이 서로 연결될 때 기술은 단순한 도구를 넘어 더욱 의미 있는 역할을 하게 됩니다.<br />예를 들어, 기술은 사람들 간의 의사소통을 원활하게 하고 다양한 문화와 배경을 가진 이들이 서로 이해하고 협력할 수 있는 플랫폼을 제공합니다. 저는 사람들 간의 관계를 기술로 이어주는 가교와 같은 개발자가 되고 싶습니다. <br /> 기술을 통해 사람들의 경험을 풍부하게 하고 커뮤니티를 형성하며 서로의 이해를 증진시키는 데 기여하고자 합니다."
  },
  "info": {
    "phone Number": { "data": "/img/dalramjwi_personal2.png", "method": "img" },
    "e mail": { "data": "/img/dalramjwi_personal.png", "method": "img" },
    "github": {
      "data": "https://github.com/dalramjwi",
      "method": "a",
      "paragraph": "CONNECT TO MY GITHUB"
    },
    "stack": {
      "data": {
        "language": ["JavaScript", "TypeScript", "Python"],
        "framework": [
          "React",
          "Next.js",
          "Nest.js",
          "Node.js",
          "TailwindCSS",
          "Vanilla Extract",
          "FastAPI",
          "TensorFlow",
          "PyTorch",
          "BeautifulSoup4",
          "Selenium"
        ],
        "markup": ["HTML5", "CSS3"],
        "database": ["Sqlite3", "PostgreSQL", "MongoDB"],
        "tool": ["Git", "GitHub", "Slack", "Figma", "Notion", "Jira"],
        "devops": ["AWS S3", "AWS Amplify", "AWS EC2", "Docker"]
      },
      "method": "text"
    },
    "study": {
      "data": {
        "title": [
          "일일 작업 관리",
          "일일 작업 일지 / 작업 기록",
          "개념 학습 정리",
          "문제 해결 및 내역 기록"
        ],
        "description": [
          "매일의 작업 및 학습 목표를 명확히 하기 위해, 일일 작업 목록(Todo List)을 작성합니다. 작업 및 학습할 내용 리스트업: 매일 수행해야 할 작업과 학습할 내용을 정리합니다. 이 단계에서는 해당 일에 꼭 필요한 작업뿐 아니라 장기적인 학습 목표와 연결되는 작업도 포함하여 전체적인 방향성을 설정합니다. 우선순위 조정: 각 작업의 중요성과 시급성을 평가하여 우선순위를 조정합니다. 여기서는 마감 기한이 있는 작업이나 결과가 즉각적으로 요구되는 업무를 먼저 처리할 수 있도록 순서를 조정합니다. 진행 상황 모니터링:하루가 끝난 후 작업 일지를 작성하며, 완료한 작업을 점검하고 끝내지 못한 작업은 다음 날로 이월합니다. 이 과정에서 어떤 작업이 완료되었고, 어떤 이유로 미완료되었는지를 추가적으로 기록함으로써 향후 계획 수립 시 참고할 수 있도록 합니다. 이러한 일일 작업 목록 관리 방법은 제 학습의 효율성을 높여주었으며 일의 시급성을 고려하여 우선적으로 처리해야 할 업무를 명확히 구분하도록 도움이 되었습니다. 또한, 체계적인 접근 방식을 통해 목표를 세분화하고 각 단계를 착실히 이행함으로써 종합적인 목표 달성에 기여하고 있습니다.결과적으로 이 과정을 통해 보다 효과적으로 시간을 관리하고 학습 및 업무 성과를 높일 수 있었습니다.",
          "학습 내용을 요약하고 느낀 점을 기록하여 발전에 기여했습니다. 하루 동안 노션을 활용하여 작성한 기록물들을 형식에 맞게 멘션하였으며, 이를 통해 특정 작업과 관련된 기록을 찾아볼 때 중심이 되는 허브 역할을 하도록 하였습니다. 각 작업을 수행한 이유와 방법, 발생한 문제 및 해결 과정을 간략히 정리함으로써 작업 및 학습의 진척도를 회고하는 데 도움을 주었습니다. 이러한 기록 방식은 학습의 진척 상황을 명확하게 파악할 수 있도록 도와주며 더 나은 학습 계획을 세우고 부족한 점을 보완하는 데 도움이 되었습니다.",
          "개념을 학습한 후, 이를 체계적으로 정리하는 과정을 통해 이해도를 높이고 기억을 강화했습니다. 처음 새로운 개념을 접할 때, 그 내용을 간단히 요약하여 노트에 기록했습니다. 이 과정에서 핵심 용어와 용어의 정의를 중심으로 정리하여 나중에 쉽게 복습할 수 있도록 하였습니다. 개념을 학습하는 도중에 궁금증이 발생하면, 먼저 1차적으로 기본 개념을 익히고 그 개념을 올바르게 이해했는지 확인하기 위해 동료들과 대화를 통해 2차적인 검증을 진행했습니다. 이러한 방법은 잘못 이해하는 것을 방지하는 데 큰 도움이 되었으며, 동료와의 대화를 하는 행동이 개념을 오래 기억하는데에도 유용했습니다. 결과적으로 이러한 체계적인 정리와 검증 과정을 통해 얻은 지식은 향후 학습의 질을 높이는 데 도움을 주었습니다.",
          "작업 중 발생한 문제를 구체적으로 기록하고, 이를 해결한 과정을 체계적으로 정리하여 유사한 문제가 발생했을 때 참고하거나 동료와 공유하는 데 활용했습니다. 문제 해결의 첫 단계로, 문제 발생 시기를 포함한 상황을 상세히 기록하였습니다. 또한 문제의 본질을 이해하기 위해 해당 작업에 대한 초기 계획과 목표를 다시 검토했습니다. 그 이후에는 문제가 어떤 이유로 발생했는지를 분석하고, 발생한 문제에 대해 어떤 방식을 사용하여 해결하려고 하는지를 구체적으로 기록했습니다. 각 해결 방법을 선택한 이유를 명확히 설명하며, 이를 통해 내가 어떻게 문제를 접근했는지를 잘 보여주기 위해 노력했습니다.특히 문제 해결 과정에서 적용한 개념이나 원리에 대해서도 상세하게 기록했습니다. 이러한 방식은 내가 선택한 해결책이 왜 효과적인지 이해하는 데 도움이 되었으며 향후 비슷한 문제에 직면했을 때 유용하게 참고할 수 있는 자료가 되었습니다."
        ],
        "imgurl": [
          "/img/study_todo.jpg",
          "/img/study_record.jpg",
          "/img/study_logic.jpg",
          "/img/study_matter.jpg"
        ]
      },
      "method": "modal",
      "paragraph": "ABOUT STUDY"
    }
  }
}
